emb4fun/tinyone-evk1060/bootloader/library/tal_rt1060evk/cpu/nxp/imxrt1060/src/talcpu_can.c
/**************************************************************************
*  This file is part of the TAL project (Tiny Abstraction Layer)
*
*  Copyright (c) 2020-2022 by Michael Fischer (www.emb4fun.de).
*  All rights reserved.
*
*  Redistribution and use in source and binary forms, with or without 
*  modification, are permitted provided that the following conditions 
*  are met:
*  
*  1. Redistributions of source code must retain the above copyright 
*     notice, this list of conditions and the following disclaimer.
*
*  2. Redistributions in binary form must reproduce the above copyright
*     notice, this list of conditions and the following disclaimer in the 
*     documentation and/or other materials provided with the distribution.
*
*  3. Neither the name of the author nor the names of its contributors may 
*     be used to endorse or promote products derived from this software 
*     without specific prior written permission.
*
*  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
*  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
*  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS 
*  FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL 
*  THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, 
*  INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, 
*  BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS 
*  OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED 
*  AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, 
*  OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF 
*  THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF 
*  SUCH DAMAGE.
**************************************************************************/
#define __TALCPU_CAN_C__

/*=======================================================================*/
/*  Include                                                              */
/*=======================================================================*/
#include <string.h>
#include "tal.h"
#include "imxrt_cpu.h"

#include "fsl_flexcan.h"

/*=======================================================================*/
/*  All Structures and Common Constants                                  */
/*=======================================================================*/

/*
 * We will want to work with 32 filters, not more and not less.
 * For this 32 filters, 8 mailboxes must be used. That mean in
 * total 14 mailboxes (6 FIFO + 8 Filter) are needed.
 *
 * Mailbox 0 - 13 FIFO & Filter
 * Mailbox 14     Spare
 * Mailbox 15     TX-Mailbox
 *
 * Total mailbox count 16
 */
#if (CAN_MAX_FILTER_COUNT != 32)
   Error: CAN_MAX_FILTER_COUNT must be defined to 32;
#endif    


#define CAN_CLK_FREQ             (24000000)

/*
 * Filter defines
 */
#define FILTER_NOT_USED          (0x7FFFFFFF)
#define FILTER_MASK_ALL_BITS     (0x7FFFFFFF)

#define FILTER_ID_MASK           (0x1FFFFFFF)
#define FILTER_IN_USE_FLAG       (0x80000000)
#define FILTER_IS_EXT_FLAG       (0x40000000)
#define FILTER_IS_ALL_FLAG       (0x20000000)

#define FILTER_ID(_x)            (_x & FILTER_ID_MASK)
#define IS_FILTER_IN_USE(_x)     (_x & FILTER_IN_USE_FLAG)
#define IS_FILTER_EXT(_x)        (_x & FILTER_IS_EXT_FLAG)
#define IS_FILTER_ALL(_x)        (_x & FILTER_IS_ALL_FLAG)

#define TX_MBOX_INDEX            (15)
#define TX_MBOX_IMASK            (1<<TX_MBOX_INDEX)

#define CAN_STD_ENTRY_ID_MASK    (0x7FF)
#define CAN_EXT_ENTRY_ID_MASK    (0x1FFFFFFF)


#define STAT_INC(_x)             if (_x < UINT32_MAX) _x++


/*! @brief FlexCAN Internal State. */
enum _flexcan_state
{
   kFLEXCAN_StateIdle     = 0x0, /*!< MB/RxFIFO idle.*/
   kFLEXCAN_StateRxData   = 0x1, /*!< MB receiving.*/
   kFLEXCAN_StateRxRemote = 0x2, /*!< MB receiving remote reply.*/
   kFLEXCAN_StateTxData   = 0x3, /*!< MB transmitting.*/
   kFLEXCAN_StateTxRemote = 0x4, /*!< MB transmitting remote request.*/
   kFLEXCAN_StateRxFifo   = 0x5  /*!< RxFIFO receiving.*/
};

/*=======================================================================*/
/*  Definition of all local Data                                         */
/*=======================================================================*/

static TAL_CAN_DCB     *DCBArray[TAL_CAN_PORT_MAX];
static flexcan_handle_t HandleArray[TAL_CAN_PORT_MAX];

/*=======================================================================*/
/*  Definition of all local Procedures                                   */
/*=======================================================================*/

/*************************************************************************/
/*  CheckUnhandleInterruptEvents                                         */
/*                                                                       */
/*  Check unhandle interrupt events.                                     */
/*                                                                       */
/*  Return TRUE if unhandled interrupt action exist, FALSE if no         */
/*  unhandlered interrupt action exist.                                  */
/*                                                                       */
/*  In    : base                                                         */
/*  Out   : none                                                         */
/*  Return: true / false                                                 */
/*************************************************************************/
static bool CheckUnhandleInterruptEvents (CAN_Type *base)
{
   uint64_t tempmask;
   uint64_t tempflag;
   bool     ret = false;

   /* Checking exist error flag. */
   if (0U == (FLEXCAN_GetStatusFlags(base) &
              ((uint32_t)kFLEXCAN_TxWarningIntFlag | (uint32_t)kFLEXCAN_RxWarningIntFlag |
               (uint32_t)kFLEXCAN_BusOffIntFlag    | (uint32_t)kFLEXCAN_ErrorIntFlag     | (uint32_t)kFLEXCAN_WakeUpIntFlag)))
   {
      tempmask = (uint64_t)base->IMASK1;
      tempflag = (uint64_t)base->IFLAG1;

#if (defined(FSL_FEATURE_FLEXCAN_HAS_EXTENDED_FLAG_REGISTER)) && (FSL_FEATURE_FLEXCAN_HAS_EXTENDED_FLAG_REGISTER > 0)
      /* Checking whether exist MB interrupt status and legacy RX FIFO interrupt status. */
      tempmask |= ((uint64_t)base->IMASK2) << 32;
      tempflag |= ((uint64_t)base->IFLAG2) << 32;
#endif
      ret = (0U != (tempmask & tempflag));
   }
   else
   {
      ret = true;
   }

   return(ret);
} /* CheckUnhandleInterruptEvents */

/*************************************************************************/
/*  UpdateAcceptanceFilter                                               */
/*                                                                       */
/*  Update the acceptance filter.                                        */
/*                                                                       */
/*  In    : pDCB                                                         */
/*  Out   : none                                                         */
/*  Return: none                                                         */
/*************************************************************************/
static TAL_RESULT UpdateAcceptanceFilter (TAL_CAN_DCB *pDCB)
{
   uint8_t    bIndex;
   uint32_t  *FilterArray = pDCB->HW.FilterArray;
   CAN_Type  *pCANx;
   uint32_t  *pFilterBase;
   uint32_t   dIdentifier;
   uint32_t   dFilterValue;

   /* Get CAN pointer */
   pCANx = (CAN_Type*)pDCB->HW.dBaseAddress;

