emb4fun/tinyone-evk1060/bootloader/library/tal_rt1060evk/cpu/nxp/imxrt1060/src/talcpu_can.c
   /* Enter Freeze Mode. */
   FLEXCAN_EnterFreezeMode(pCANx);
   
   /*lint -save -e661 -e662 -e831 */

   /* Get filter base */
   pFilterBase = (uint32_t*)&(pCANx->MB[6].CS);
   
   /* Setup the complete filter */
   for (bIndex = 0; bIndex < CAN_MAX_FILTER_COUNT; bIndex++)
   {
      if (IS_FILTER_IN_USE(FilterArray[bIndex]))
      {
         dIdentifier = FILTER_ID(FilterArray[bIndex]);
      
         if (IS_FILTER_EXT(FilterArray[bIndex]))
         {
            dFilterValue = FLEXCAN_RX_FIFO_EXT_MASK_TYPE_A(dIdentifier, 0, 1);
         }
         else
         {
            dFilterValue = FLEXCAN_RX_FIFO_STD_MASK_TYPE_A(dIdentifier, 0, 0);
         }
         
         pFilterBase[bIndex] = dFilterValue;
         
         /* Check if it is an ALL filter */
         if (IS_FILTER_ALL(FilterArray[bIndex]))
         {
            /* Check only the IDE bit */
            pCANx->RXIMR[bIndex] = 0x40000000;
         }
         else
         {
            pCANx->RXIMR[bIndex] = FILTER_MASK_ALL_BITS;
         }
      }
      else
      {
         pFilterBase[bIndex]  = FILTER_NOT_USED;
         pCANx->RXIMR[bIndex] = FILTER_MASK_ALL_BITS;
      }         
   }

   /*lint -restore */
   
   /* Exit Freeze Mode. */
   FLEXCAN_ExitFreezeMode(pCANx);

   return(TAL_OK);
} /* UpdateAcceptanceFilter */

/*************************************************************************/
/*  CANIdentRegister                                                     */
/*                                                                       */
/*  Register a CAN identifier in the acceptance filter.                  */
/*                                                                       */
/*  In    : pDCB, dIdentifier, Type                                      */
/*  Out   : none                                                         */
/*  Return: TAL_OK / error cause                                         */
/*************************************************************************/
static TAL_RESULT CANIdentRegister (TAL_CAN_DCB   *pDCB,
                                    uint32_t       dIdentifier,
                                    TAL_CAN_TYPE_ID Type)
{
   TAL_RESULT  Error = TAL_ERROR;
   uint16_t   wIndex;
   uint32_t  *FilterArray = pDCB->HW.FilterArray;
   uint8_t    bRegsiterOK = TAL_FALSE;
   uint32_t   dAllFlag    = 0;
   
   
   /* 
    * Handle special case TAL_CAN_ID_RX_ALL, all identifier
    * from type STD or EXT should be received.
    */
   if (TAL_CAN_ID_RX_ALL == dIdentifier)
   {
      dIdentifier = 0;
      dAllFlag    = FILTER_IS_ALL_FLAG;
   } /* end if (TAL_CAN_ID_RX_ALL == dIdentifier) */


   /*
    * Check for STD or EXT identifier
    */   
   if (TAL_CAN_TYPE_STD_ID == Type)
   {
      /* Check valid range */
      if (dIdentifier > CAN_STD_ENTRY_ID_MASK)
      {
         Error = TAL_ERR_CAN_ID_RANGE;
         goto IdentRegisterEnd;  /*lint !e801*/
      } 
   }
   else
   {
      /* Check valid range */
      if (dIdentifier > CAN_EXT_ENTRY_ID_MASK)
      {
         Error = TAL_ERR_CAN_ID_RANGE;
         goto IdentRegisterEnd;  /*lint !e801*/
      }

      dIdentifier |= FILTER_IS_EXT_FLAG; 
   }
   
   dIdentifier |= FILTER_IN_USE_FLAG;
   dIdentifier |= dAllFlag;
   
   /*
    * Check if this identifier is registered
    */
   for (wIndex = 0; wIndex < CAN_MAX_FILTER_COUNT; wIndex++)
   {
      if (FilterArray[wIndex] == dIdentifier)
      {
         Error = TAL_ERR_CAN_ID_USED;
         goto IdentRegisterEnd;  /*lint !e801*/
      }
   }
   
   
   /*
    * At this point the identifier is not registered.
    * Find a free entry which can be used.
    */
   for (wIndex = 0; wIndex < CAN_MAX_FILTER_COUNT; wIndex++)
   {
      if (0 == IS_FILTER_IN_USE(FilterArray[wIndex]))
      {
         FilterArray[wIndex] = dIdentifier;
         bRegsiterOK         = TAL_TRUE;
         break;
      }
   }      
   if (TAL_FALSE == bRegsiterOK)
   {
      Error = TAL_ERR_CAN_ID_NO_ENTRY;
      goto IdentRegisterEnd;  /*lint !e801*/
   }


   /*
    * At this point an update of the Acceptance Filter is needed
    */
   Error = UpdateAcceptanceFilter(pDCB);    
   
IdentRegisterEnd:   
   return(Error);
} /* CANIdentRegister */   

/*************************************************************************/
/*  CANIdentDeRegister                                                   */
/*                                                                       */
/*  DeRegister a CAN identifier from the acceptance filter.              */
/*                                                                       */
/*  In    : pDCB, dIdentifier, Type                                      */
/*  Out   : none                                                         */
/*  Return: TAL_OK / error cause                                         */
/*************************************************************************/
static TAL_RESULT CANIdentDeRegister (TAL_CAN_DCB   *pDCB,
                                      uint32_t       dIdentifier,
                                      TAL_CAN_TYPE_ID Type)
{
   TAL_RESULT  Error = TAL_ERROR;     
   uint16_t   wIndex;
   uint32_t  *FilterArray   = pDCB->HW.FilterArray;
   uint8_t    bDeRegsiterOK = TAL_FALSE;
   uint32_t   dAllFlag      = 0;
  

   /* 
    * Handle special case TAL_CAN_ID_RX_ALL, all identifier
    * from type STD or EXT should be received.
    */
   if (TAL_CAN_ID_RX_ALL == dIdentifier)
   {
      dIdentifier = 0;
      dAllFlag    = FILTER_IS_ALL_FLAG;
   } /* end if (TAL_CAN_ID_RX_ALL == dIdentifier) */

  
   /*
    * Check for STD or EXT identifier
    */   
   if (TAL_CAN_TYPE_STD_ID == Type)
   {
      /* Check valid range */
      if (dIdentifier > CAN_STD_ENTRY_ID_MASK)
      {
         Error = TAL_ERR_CAN_ID_RANGE;
         goto IdentDeRegisterEnd;   /*lint !e801*/
      }
   }
   else
   {
      /* Check valid range */
      if (dIdentifier > CAN_EXT_ENTRY_ID_MASK)
      {
         Error = TAL_ERR_CAN_ID_RANGE;
         goto IdentDeRegisterEnd;   /*lint !e801*/
      }
      
      dIdentifier |= FILTER_IS_EXT_FLAG; 
   }
   
