emb4fun/tinyone-evk1060/bootloader/library/tal_rt1060evk/cpu/nxp/imxrt1060/src/talcpu_can.c
   dIdentifier |= FILTER_IN_USE_FLAG;
   dIdentifier |= dAllFlag;
   
   /*
    * Check if this identifier is registered,
    * and remove it from the list if available.
    */
   for (wIndex = 0; wIndex < CAN_MAX_FILTER_COUNT; wIndex++)
   {
      if (FilterArray[wIndex] == dIdentifier)
      {
         FilterArray[wIndex] = 0;
         bDeRegsiterOK       = TAL_TRUE;
         break;
      }
   }
   if (TAL_FALSE == bDeRegsiterOK)
   {
      Error = TAL_ERR_CAN_ID_NOT_USED;
      goto IdentDeRegisterEnd;   /*lint !e801*/
   }

   /*
    * At this point an update of the Acceptance Filter is needed
    */
   Error = UpdateAcceptanceFilter(pDCB);    

IdentDeRegisterEnd:   
   return(Error);
} /* CANIdentDeRegister */   

/*************************************************************************/
/*  SendObject                                                           */
/*                                                                       */
/*  Try to send the given Object.                                        */
/*                                                                       */
/*  In    : pDCB, pCANx, pCANObject                                      */
/*  Out   : none                                                         */
/*  Return: TAL_OK                                                       */
/*************************************************************************/
static void SendObject (TAL_CAN_DCB *pDCB, CAN_Type *pCANx, TAL_CAN_OBJECT *pCANObject)
{
   static flexcan_frame_t frame; /* Use static to putting frame in bss and not at local stack */

   if ((uint8_t)kFLEXCAN_StateIdle == pDCB->HW.pHandle->mbState[TX_MBOX_INDEX])
   {
      pDCB->HW.pHandle->mbState[TX_MBOX_INDEX] = (uint8_t)kFLEXCAN_StateTxData;
      
      memset(&frame, 0x00, sizeof(frame));
      
      /* Convert CANObject to frame */
      if (pCANObject->bFlags & TAL_CAN_OBJECT_FLAGS_STD_ID)
      {
         frame.id     = FLEXCAN_ID_STD(pCANObject->dIdentifier);
         frame.format = (uint8_t)kFLEXCAN_FrameFormatStandard;
      }
      else
      {
         frame.id     = FLEXCAN_ID_EXT(pCANObject->dIdentifier);
         frame.format = (uint8_t)kFLEXCAN_FrameFormatExtend;
      }
      frame.type   = (uint8_t)kFLEXCAN_FrameTypeData;
      frame.length = (uint8_t)pCANObject->bDLC;
      
      frame.dataByte0 = pCANObject->Data[0];
      frame.dataByte1 = pCANObject->Data[1];
      frame.dataByte2 = pCANObject->Data[2];
      frame.dataByte3 = pCANObject->Data[3];
      frame.dataByte4 = pCANObject->Data[4];
      frame.dataByte5 = pCANObject->Data[5];
      frame.dataByte6 = pCANObject->Data[6];
      frame.dataByte7 = pCANObject->Data[7];

      /* Send frame */      
      if (kStatus_Success == FLEXCAN_WriteTxMb(pCANx, TX_MBOX_INDEX, &frame))
      {
         /* Enable Message Buffer Interrupt. */
         FLEXCAN_EnableMbInterrupts(pCANx, (uint64_t)TX_MBOX_IMASK);
      }
      else
      {
         pDCB->HW.pHandle->mbState[TX_MBOX_INDEX] = (uint8_t)kFLEXCAN_StateIdle;
      }      
   }
   
} /* SendObject */

/*************************************************************************/
/*  TX_IRQHandler                                                        */
/*                                                                       */
/*  This is the generic CAN TX IRQHandler.                               */
/*                                                                       */
/*  In    : pCANx, pDCB, dFlags                                          */
/*  Out   : none                                                         */
/*  Return: none                                                         */
/*************************************************************************/
static void TX_IRQHandler (CAN_Type *pCANx, TAL_CAN_DCB *pDCB, uint32_t dFlags)
{
   TAL_RESULT     Error;
   TAL_CAN_OBJECT CANObject;
   
   (void)dFlags;

   /* Solve Tx Data Frame. */
   FLEXCAN_TransferAbortSend(pCANx, pDCB->HW.pHandle, TX_MBOX_INDEX);
   
   /* Clear resolved Message Buffer IRQ. */
   FLEXCAN_ClearMbStatusFlags(pCANx, (uint64_t)TX_MBOX_IMASK);
   
   STAT_INC(pDCB->HW.Stat.dTXCount);
   
   /* 
    * Check for TX interrupt, but only if it is anabled 
    */
   if (1 == pDCB->HW.nTxRunning)
   {
      /* Read Object from the ring buffer */
      Error = tal_MISCRingGet(&pDCB->TxRing, (uint8_t*)&CANObject);
      if (Error != TAL_OK)
      {
         /* Ups, no data available, disable interrupt */
         pDCB->HW.nTxRunning = 0;
      }
      else
      {
         /* Send Object */
         SendObject(pDCB, pCANx, &CANObject); 
      }   
   } /* end "TX interrupt */

} /* TX_IRQHandler */

/*************************************************************************/
/*  RX_IRQHandler                                                        */
/*                                                                       */
/*  This is the generic CAN RX IRQHandler.                               */
/*                                                                       */
/*  In    : pDCB                                                         */
/*  Out   : none                                                         */
/*  Return: none                                                         */
/*************************************************************************/
static void RX_IRQHandler (CAN_Type *pCANx, TAL_CAN_DCB *pDCB, uint32_t dFlags)
{
   TAL_RESULT     Error;
   TAL_CAN_OBJECT CANObject;
   uint32_t       CS;
   uint32_t       ID;
   uint32_t       WORD0;
   uint32_t       WORD1;
   uint32_t       IDHIT;
   uint8_t       bRXValid;

   do
   {
      /* Check FIFO overflow */
      if (dFlags & CAN_IFLAG1_BUF7I_MASK) STAT_INC(pDCB->HW.Stat.dFIFOOverflow);
      if (dFlags & CAN_IFLAG1_BUF6I_MASK) STAT_INC(pDCB->HW.Stat.dFIFOWarning);

      CS    = pCANx->MB[0].CS;
      ID    = pCANx->MB[0].ID;
      WORD0 = pCANx->MB[0].WORD0;
      WORD1 = pCANx->MB[0].WORD1;
      IDHIT = (pCANx->RXFIR & CAN_RXFIR_IDHIT_MASK) & (CAN_MAX_FILTER_COUNT - 1);

      /* Read free-running timer to unlock Rx Message Buffer. */
      (void)pCANx->TIMER;
      
