emb4fun/tinyone-evk1060/bootloader/library/tal_rt1060evk/cpu/nxp/imxrt1060/src/talcpu_can.c
      /* ACK interrupt */
      pCANx->IFLAG1 = (CAN_IFLAG1_BUF7I_MASK | CAN_IFLAG1_BUF6I_MASK | CAN_IFLAG1_BUF5I_MASK);
      
      /* Get Identifier */
      if (CS & CAN_CS_IDE_MASK)
      {
         /* 29 bit Identifier */
         CANObject.bFlags      = TAL_CAN_OBJECT_FLAGS_EXT_ID;
         CANObject.dIdentifier = ID & (CAN_ID_EXT_MASK | CAN_ID_STD_MASK);
      }
      else
      {
         /* 11 bit Identifier */
         CANObject.bFlags      = TAL_CAN_OBJECT_FLAGS_STD_ID;
         CANObject.dIdentifier = (ID & CAN_ID_STD_MASK) >> CAN_ID_STD_SHIFT;
      }
      
      /* Check if we should receive this identifier */
      bRXValid = 0;
      if      ( (FILTER_ID(pDCB->HW.FilterArray[IDHIT]) == CANObject.dIdentifier) &&
                (TAL_CAN_OBJECT_FLAGS_EXT_ID            == CANObject.bFlags)      &&
                (IS_FILTER_EXT(pDCB->HW.FilterArray[IDHIT]))                      )
      {
         bRXValid = 1;
      }
      else if ( (FILTER_ID(pDCB->HW.FilterArray[IDHIT]) == CANObject.dIdentifier) &&
                (TAL_CAN_OBJECT_FLAGS_STD_ID            == CANObject.bFlags)      &&
                (!IS_FILTER_EXT(pDCB->HW.FilterArray[IDHIT]))                     )
      {
         bRXValid = 1;
      }
      else if ( (IS_FILTER_ALL(pDCB->HW.FilterArray[IDHIT]))                      &&
                (TAL_CAN_OBJECT_FLAGS_EXT_ID            == CANObject.bFlags)      &&
                (IS_FILTER_EXT(pDCB->HW.FilterArray[IDHIT]))                      )
      {                
         bRXValid = 1;
      }
      else if ( (IS_FILTER_ALL(pDCB->HW.FilterArray[IDHIT]))                      &&
                (TAL_CAN_OBJECT_FLAGS_STD_ID            == CANObject.bFlags)      &&
                (!IS_FILTER_EXT(pDCB->HW.FilterArray[IDHIT]))                     )
      {                
         bRXValid = 1;
      }
      
      /* Complete only if this is valid */
      if (1 == bRXValid)
      {
         /* Get the message length. */
         CANObject.bDLC = (uint8_t)((CS & CAN_CS_DLC_MASK) >> CAN_CS_DLC_SHIFT);

         /* Get data */
         CANObject.Data[3] = (uint8_t)(WORD0 & 0xFF);
         WORD0 = WORD0 >> 8;
         CANObject.Data[2] = (uint8_t)(WORD0 & 0xFF);
         WORD0 = WORD0 >> 8;
         CANObject.Data[1] = (uint8_t)(WORD0 & 0xFF);
         WORD0 = WORD0 >> 8;
         CANObject.Data[0] = (uint8_t)(WORD0 & 0xFF);

         CANObject.Data[7] = (uint8_t)(WORD1 & 0xFF);
         WORD1 = WORD1 >> 8;
         CANObject.Data[6] = (uint8_t)(WORD1 & 0xFF);
         WORD1 = WORD1 >> 8;
         CANObject.Data[5] = (uint8_t)(WORD1 & 0xFF);
         WORD1 = WORD1 >> 8;
         CANObject.Data[4] = (uint8_t)(WORD1 & 0xFF);

         /* If we have no overflow... */
         if (TAL_FALSE == pDCB->bRxOverflow)
         {
            /* ... put it into the ring buffer */
            Error = tal_MISCRingAdd(&pDCB->RxRing, (uint8_t*)&CANObject);
            if (TAL_OK == Error)
            {
               /* Signal counting semaphore */
               OS_SemaSignalFromInt(&pDCB->RxRdySema);
            }
            else
            {
               /* Ups, overflow */
               pDCB->bRxOverflow = TAL_OK;

               STAT_INC(pDCB->HW.Stat.dOverunCount);
            }
         } 
   
         STAT_INC(pDCB->HW.Stat.dRXCount);
      } /* end if (1 == bRXValid) */         
      
      /* Check if still more messages are availabe in the FIFO */      
      dFlags = pCANx->IFLAG1 & (CAN_IFLAG1_BUF7I_MASK | CAN_IFLAG1_BUF6I_MASK | CAN_IFLAG1_BUF5I_MASK); 
      
   } while (dFlags & CAN_IFLAG1_BUF5I_MASK);     
   
} /* RX_IRQHandler */

/*************************************************************************/
/*  ERR_IRQHandler                                                       */
/*                                                                       */
/*  This is the generic CAN Error IRQHandler.                            */
/*                                                                       */
/*  In    : pDCB                                                         */
/*  Out   : none                                                         */
/*  Return: none                                                         */
/*************************************************************************/
static void ERR_IRQHandler (CAN_Type *pCANx, TAL_CAN_DCB *pDCB, uint32_t dFlags)
{
   TAL_RESULT     Error;
   TAL_CAN_OBJECT CANObject;
   uint32_t dACK;
   
   /* Clear FlexCAN Error and Status Interrupt. */
   dACK = (CAN_ESR1_TWRNINT_MASK |
           CAN_ESR1_RWRNINT_MASK | 
           CAN_ESR1_BOFFINT_MASK |
           CAN_ESR1_ERRINT_MASK  );
           
   /* Check for ACK_ERR */
   if (dFlags & CAN_ESR1_ACKERR_MASK)
   {
      dACK |= CAN_ESR1_ACKERR_MASK;

      STAT_INC(pDCB->HW.Stat.dACKError);

      /*
      * This bit indicates that an Acknowledge Error has been detected by
      * the transmitter node, i.e., a dominant bit has not been detected
      * during the ACK SLOT.
      *
      * Therefore abort a transmitting frame if available.
      */
      if (dFlags & CAN_ESR1_TX_MASK)
      {      
         /* Abort frame */
         FLEXCAN_TransferAbortSend(pCANx, pDCB->HW.pHandle, TX_MBOX_INDEX);
         FLEXCAN_ClearMbStatusFlags(pCANx, (uint64_t)TX_MBOX_IMASK);

         /* Check if a new frame is available to send */
         /* Read Object from the ring buffer */
         Error = tal_MISCRingGet(&pDCB->TxRing, (uint8_t*)&CANObject);
         if (Error != TAL_OK)
         {
            /* Ups, no data available, disable interrupt */
            pDCB->HW.nTxRunning = 0;
         }
         else
         {
            /* Send Object */
            SendObject(pDCB, pCANx, &CANObject); 
         }   
      }
   }
           
   /* Acknowledge error interrupt */
   pCANx->ESR1 = dACK;

} /* ERR_IRQHandler */

/*************************************************************************/
/*  CAN_IRQHandler                                                       */
/*                                                                       */
/*  This is the Cortex CAN IRQ handler.                                  */
/*                                                                       */
/*  In    : none                                                         */
/*  Out   : none                                                         */
/*  Return: none                                                         */
/*************************************************************************/
void CAN_IRQHandler (TAL_CAN_DCB *pDCB)
{
   CAN_Type *pCANx = (CAN_Type*)pDCB->HW.dBaseAddress;
   uint32_t  dESRStatus;
   uint32_t  dValue;
   
   do 
   {   
      /* Get Current FlexCAN Module Error and Status. */
      dESRStatus = pCANx->ESR1;
   
