emb4fun/tinyone-evk1060/bootloader/library/tal_rt1060evk/cpu/nxp/imxrt1060/src/talcpu_can.c
      /* To handle FlexCAN Error and Status Interrupt first. */
      if (0U != (dESRStatus & (CAN_ESR1_TWRNINT_MASK | CAN_ESR1_RWRNINT_MASK |
                               CAN_ESR1_BOFFINT_MASK | CAN_ESR1_ERRINT_MASK) ))
      {
         /* Handle ERROR interrupt */
         ERR_IRQHandler(pCANx, pDCB, dESRStatus);
      }
      else if (0U != (dESRStatus & CAN_ESR1_WAKINT_MASK))
      {
         /* Acknowledge wakeup interrupt */
         pCANx->ESR1 = CAN_ESR1_WAKINT_MASK;
      }
      else
      {
         /* Handle RX/TX interrupt */
         dValue = pCANx->IFLAG1 & (TX_MBOX_IMASK | CAN_IFLAG1_BUF7I_MASK | CAN_IFLAG1_BUF6I_MASK | CAN_IFLAG1_BUF5I_MASK);
         if (dValue & CAN_IFLAG1_BUF5I_MASK)
         {
            RX_IRQHandler(pCANx, pDCB, dValue);     
         }
         
         dValue = pCANx->IFLAG1 & TX_MBOX_IMASK;
         if (dValue & TX_MBOX_IMASK)
         {
            TX_IRQHandler(pCANx, pDCB, dValue);     
         }
      }
      
   } while ( CheckUnhandleInterruptEvents(pCANx) );      
   
} /* CAN_IRQHandler */

/*=======================================================================*/
/*  All code exported                                                    */
/*=======================================================================*/

/*************************************************************************/
/*  cpu_CANInit                                                          */
/*                                                                       */
/*  Prepare the hardware for use by the Open function later. Set the HW  */
/*  information depending of ePort and "enable" the CAN port.            */
/*                                                                       */
/*  In    : pDCB                                                         */
/*  Out   : none                                                         */
/*  Return: TAL_OK / error cause                                         */
/*************************************************************************/
TAL_RESULT cpu_CANInit (TAL_CAN_DCB *pDCB)
{
   TAL_RESULT    Error = TAL_ERR_CAN_PORT_RANGE;
   TAL_CAN_HW  *pHW    = &pDCB->HW;

   switch (pDCB->ePort)
   {
      case TAL_CAN_PORT_1:
      {
         Error = tal_BoardEnableCAN1();
         if (TAL_OK == Error)
         {
            DCBArray[TAL_CAN_PORT_1] = pDCB;
         
            pHW->dBaseAddress = CAN1_BASE;
            pHW->nIrqNumber   = CAN1_IRQn;
            pHW->nIrqPriority = CAN1_PRIO;
            pHW->nTxRunning   = TAL_FALSE;
            
            /* Set irq and priority */
            tal_CPUIrqSetPriority(pHW->nIrqNumber, pHW->nIrqPriority);
         }
         break;
      } /* TAL_CAN_PORT_1 */

      case TAL_CAN_PORT_2:
      {
         Error = tal_BoardEnableCAN2();
         if (TAL_OK == Error)
         {
            DCBArray[TAL_CAN_PORT_2] = pDCB;
         
            pHW->dBaseAddress = CAN2_BASE;
            pHW->nIrqNumber   = CAN2_IRQn;
            pHW->nIrqPriority = CAN2_PRIO;
            pHW->nTxRunning   = TAL_FALSE;
            
            /* Set irq and priority */
            tal_CPUIrqSetPriority(pHW->nIrqNumber, pHW->nIrqPriority);
         }
         break;
      } /* TAL_CAN_PORT_2 */
      
      default:
      {
         /* Do nothing */
         Error = TAL_ERR_CAN_PORT_RANGE;
         break;
      }
   } /* end switch (pDCB->ePort) */
   
   return(Error);
} /* cpu_CANInit */

/*************************************************************************/
/*  cpu_CANOpen                                                          */
/*                                                                       */
/*  Open the CAN port.                                                   */
/*                                                                       */
/*  In    : pDCB                                                         */
/*  Out   : none                                                         */
/*  Return: TAL_OK / error cause                                         */
/*************************************************************************/
TAL_RESULT cpu_CANOpen (TAL_CAN_DCB *pDCB)
{
   TAL_RESULT                Error = TAL_ERROR;
   CAN_Type                *pCANx;
   flexcan_config_t          Config;
   flexcan_handle_t        *pHandle;
   uint32_t                 dValue;
   uint32_t                 dBaudrate;
   uint8_t                  bIndex;
   uint32_t                *pFilterBase;

   /*
    * Check CAN_CLK_PODF and CAN_CLK_SEL first
    */

   /* CAN_CLK_PODF must be 0 => divide by 1 */
   dValue = ((CCM->CSCMR2 & CCM_CSCMR2_CAN_CLK_PODF_MASK) >> CCM_CSCMR2_CAN_CLK_PODF_SHIFT);
   if (dValue != 0) goto CANOpenEnd;   /*lint !e801*/

   /* CAN_CLK_SEL must be 1 => derive clock from osc_clk (24M) */
   dValue = ((CCM->CSCMR2 & CCM_CSCMR2_CAN_CLK_SEL_MASK) >> CCM_CSCMR2_CAN_CLK_SEL_SHIFT);
   if (dValue != 1) goto CANOpenEnd;   /*lint !e801*/


   /* Get CAN pointer */
   pCANx = (CAN_Type*)pDCB->HW.dBaseAddress;

   /* 
    * Check baud rate 
    */
   switch (pDCB->Settings.dBitRate)
   {
      case TAL_CAN_BR_500K: dBaudrate = 500000; break;
      case TAL_CAN_BR_250K: dBaudrate = 250000; break;
      case TAL_CAN_BR_125K: dBaudrate = 125000; break;
      case TAL_CAN_BR_100K: dBaudrate = 100000; break;
      case TAL_CAN_BR_50K:  dBaudrate = 50000;  break;
      case TAL_CAN_BR_20K:  dBaudrate = 20000;  break;
      case TAL_CAN_BR_10K:  dBaudrate = 10000;  break;
   
      default:
      {
         Error = TAL_ERR_CAN_BAUDRATE;
         goto CANOpenEnd;  /*lint !e801*/
         break;   /*lint !e527*/
      }
   } /* end switch (pDCB->Settings.dBaudrate) */

   /* Gets the default configuration structure */
   FLEXCAN_GetDefaultConfig(&Config);
   
   /* Disable self reception */
   Config.disableSelfReception = true;

   /* Set baud rate in bps */
   Config.baudRate = dBaudrate;

   /*
    * We will want to work with 32 filters, not more and not less.
    * For this 32 filters, 8 mailboxes must be used. That mean in
    * total 14 mailboxes (6 FIFO + 8 Filter) are needed.
    *
    * Mailbox 0 - 13 FIFO & Filter
    * Mailbox 14     Spare
    * Mailbox 15     TX-Mailbox
    *
    * Total mailbox count 16
    */
   Config.maxMbNum = 16;

