emb4fun/tinyone-evk1060/bootloader/library/tal_rt1060evk/cpu/nxp/imxrt1060/src/talcpu_can.c
   /* Disable Timer Synchronization */
   Config.enableTimerSync = false;

   /* Enable Rx Individual Mask */
   Config.enableIndividMask = true;

   /* Set Sample-Point point to 87.5 % */
   Config.timingConfig.phaseSeg1 = 7;
   Config.timingConfig.phaseSeg2 = 1;
   Config.timingConfig.propSeg   = 4;

   /* Initializes the FlexCAN instance */
   FLEXCAN_Init(pCANx, &Config, CAN_CLK_FREQ);

   /* Create FlexCAN handle structure and set call back function. */
   pHandle = &HandleArray[pDCB->ePort];
   FLEXCAN_TransferCreateHandle(pCANx, pHandle, NULL, NULL);
   pDCB->HW.pHandle = pHandle;

   /* 
    * Setup filter and mask 
    */

   /* Enter Freeze Mode. */
   FLEXCAN_EnterFreezeMode(pCANx);

   /* Set RFFN */
   pCANx->CTRL2 = (pCANx->CTRL2 & ~CAN_CTRL2_RFFN_MASK) | CAN_CTRL2_RFFN(3);
   
   /* Setup ID Fitlter Type. */
   pCANx->MCR = (pCANx->MCR & ~CAN_MCR_IDAM_MASK) | CAN_MCR_IDAM(0x0);  /*lint !e845*/

   /*lint -save -e661 -e662 -e831 */
   
   /* Get filter base */
   pFilterBase = (uint32_t*)&(pCANx->MB[6].CS);
   for (bIndex = 0; bIndex < CAN_MAX_FILTER_COUNT; bIndex++)
   {
      pFilterBase[bIndex] = FILTER_NOT_USED;
   }

   /*lint -restore */

   /* Setting Message Reception Priority. */
   pCANx->CTRL2 = (pCANx->CTRL2 & ~CAN_CTRL2_MRP_MASK);

   /* Enable error interrupts */
   pCANx->CTRL1 |= (CAN_CTRL1_BOFFMSK_MASK | 
                    CAN_CTRL1_ERRMSK_MASK  | 
                    CAN_CTRL1_TWRNMSK_MASK | 
                    CAN_CTRL1_RWRNMSK_MASK );

   /* Enable Rx Message FIFO. */
   pCANx->MCR |= CAN_MCR_RFEN_MASK;

   /* Setting Rx Individual Mask value. */
   for (bIndex = 0; bIndex < CAN_MAX_FILTER_COUNT; bIndex++)
   {
      pCANx->RXIMR[bIndex] = FILTER_MASK_ALL_BITS;
   }

   /* Exit Freeze Mode. */
   FLEXCAN_ExitFreezeMode(pCANx);

   /* Clear filter */   
   memset(pDCB->HW.FilterArray, 0x00, sizeof(pDCB->HW.FilterArray));
   
   /* Clear statistics */
   memset(&pDCB->HW.Stat, 0x00, sizeof(pDCB->HW.Stat));
   
   /* Clear TX running state */
   pDCB->HW.nTxRunning  = TAL_FALSE;

   /* Setup Tx Message Buffer. */
   FLEXCAN_SetTxMbConfig(pCANx, TX_MBOX_INDEX, (bool)true);
   
   /* Update filters */
   UpdateAcceptanceFilter(pDCB);

   /* 
    * Enable interrupts
    */
   pCANx->IMASK2 = 0;
   pCANx->IMASK1 = (CAN_IFLAG1_BUF7I_MASK | CAN_IFLAG1_BUF6I_MASK | CAN_IFLAG1_BUF5I_MASK);
    
   Error = TAL_OK;

CANOpenEnd:   
   return(Error);
} /* cpu_CANOpen */

/*************************************************************************/
/*  cpu_CANClose                                                         */
/*                                                                       */
/*  Close the CAN port.                                                  */
/*                                                                       */
/*  In    : pDCB                                                         */
/*  Out   : none                                                         */
/*  Return: TAL_OK / error cause                                         */
/*************************************************************************/
TAL_RESULT cpu_CANClose (TAL_CAN_DCB *pDCB)
{
   TAL_RESULT  Error = TAL_OK;
   CAN_Type  *pCANx;

   /* Get CAN pointer */
   pCANx = (CAN_Type*)pDCB->HW.dBaseAddress;

   FLEXCAN_Deinit(pCANx);

   /* Clear filter */   
   memset(pDCB->HW.FilterArray, 0x00, sizeof(pDCB->HW.FilterArray));
   
   return(Error);
} /* cpu_CANClose */

/*************************************************************************/
/*  cpu_CANStartTx                                                       */
/*                                                                       */
/*  Send the data from the ring buffer if the TX interrupt is disabled.  */
/*                                                                       */
/*  In    : pDCB                                                         */
/*  Out   : none                                                         */
/*  Return: TAL_OK / error cause                                         */
/*************************************************************************/
TAL_RESULT cpu_CANStartTx (TAL_CAN_DCB *pDCB)
{
   TAL_RESULT       Error = TAL_ERROR;
   CAN_Type       *pCANx;
   TAL_CAN_OBJECT   CANObject;
   
   /* Get CAN pointer */
   pCANx = (CAN_Type *)pDCB->HW.dBaseAddress;

   TAL_CPU_DISABLE_ALL_INTS();
   if (1 == pDCB->HW.nTxRunning)
   {
      /* TX interrupt is enabled, do nothing */
   }
   else
   {
      Error = tal_MISCRingGet(&pDCB->TxRing, (uint8_t*)&CANObject);
      if (TAL_OK == Error)
      {
         pDCB->HW.nTxRunning = 1;
         
         SendObject(pDCB, pCANx, &CANObject);
      }
   }
   TAL_CPU_ENABLE_ALL_INTS();
   
   return(Error);
} /* cpu_CANStartTx */

/*************************************************************************/
/*  cpu_CANTxIsRunning                                                   */
/*                                                                       */
/*  Check if TX is still running.                                        */
/*                                                                       */
/*  In    : pDCB                                                         */
/*  Out   : none                                                         */
/*  Return: TAL_OK / TAL_ERROR                                           */
/*************************************************************************/
TAL_RESULT cpu_CANTxIsRunning (TAL_CAN_DCB *pDCB)
{
   TAL_RESULT  Error = TAL_ERROR;

   TAL_CPU_DISABLE_ALL_INTS();
   if (1 == pDCB->HW.nTxRunning)
   {
      /* TX is still running */
      Error = TAL_OK;
   }
   else
   {
      /* TX is not running */
      Error = TAL_ERROR;
   }
   TAL_CPU_ENABLE_ALL_INTS();
   
   return(Error);
} /* cpu_CANTxIsRunning */

/*************************************************************************/
/*  cpu_CANEnableSilentMode                                              */
/*                                                                       */
/*  Enable "Silent" mode.                                                */
/*                                                                       */
/*  In    : pDCB                                                         */
/*  Out   : none                                                         */
/*  Return: TAL_OK / error cause                                         */
/*************************************************************************/
TAL_RESULT cpu_CANEnableSilentMode (TAL_CAN_DCB *pDCB)
{
   CAN_Type  *pCANx = (CAN_Type*)pDCB->HW.dBaseAddress;

