emb4fun/tinyone-evk1060/bootloader/library/tal_rt1060evk/cpu/nxp/imxrt1060/src/talcpu_can.c
   /* Enter Freeze Mode. */
   FLEXCAN_EnterFreezeMode(pCANx);
   
   pCANx->CTRL1 |= CAN_CTRL1_LOM_MASK;

   /* Exit Freeze Mode. */
   FLEXCAN_ExitFreezeMode(pCANx);
   
   return(TAL_OK);
} /* cpu_CANEnableSilentMode */

/*************************************************************************/
/*  cpu_CANDisableSilentMode                                             */
/*                                                                       */
/*  Disable "Silent" mode.                                               */
/*                                                                       */
/*  In    : pDCB                                                         */
/*  Out   : none                                                         */
/*  Return: TAL_OK / error cause                                         */
/*************************************************************************/
TAL_RESULT cpu_CANDisableSilentMode (TAL_CAN_DCB *pDCB)
{
   CAN_Type  *pCANx = (CAN_Type*)pDCB->HW.dBaseAddress;

   /* Enter Freeze Mode. */
   FLEXCAN_EnterFreezeMode(pCANx);

   pCANx->CTRL1 &= ~CAN_CTRL1_LOM_MASK;

   /* Exit Freeze Mode. */
   FLEXCAN_ExitFreezeMode(pCANx);
   
   return(TAL_OK);
} /* cpu_CANDisableSilentMode */

/*************************************************************************/
/*  cpu_CANIdentRegister                                                 */
/*                                                                       */
/*  Register a CAN identifier.                                           */
/*                                                                       */
/*  In    : pDCB, dIdentifier, Type                                      */
/*  Out   : none                                                         */
/*  Return: TAL_OK / error cause                                         */
/*************************************************************************/
TAL_RESULT cpu_CANIdentRegister (TAL_CAN_DCB  *pDCB,
                                uint32_t       dIdentifier,
                                TAL_CAN_TYPE_ID Type)
{
   TAL_RESULT  Error;

   Error = CANIdentRegister(pDCB, dIdentifier, Type);
   
   return(Error);
} /* cpu_CANIdentRegister */   

/*************************************************************************/
/*  cpu_CANIdentDeRegister                                               */
/*                                                                       */
/*  DeRegister a CAN identifier.                                         */
/*                                                                       */
/*  In    : pDCB, dIdentifier, Type                                      */
/*  Out   : none                                                         */
/*  Return: TAL_OK / error cause                                         */
/*************************************************************************/
TAL_RESULT cpu_CANIdentDeRegister (TAL_CAN_DCB  *pDCB,
                                  uint32_t       dIdentifier,
                                  TAL_CAN_TYPE_ID Type)
{
   TAL_RESULT  Error;

   Error = CANIdentDeRegister(pDCB, dIdentifier, Type);

   return(Error);
} /* cpu_CANIdentDeRegister */   

/*************************************************************************/
/*  cpu_CANGetSpeed                                                      */
/*                                                                       */
/*  Return the speed of the given port.                                  */
/*                                                                       */
/*  In    : pDCB, dIdentifier, Type                                      */
/*  Out   : none                                                         */
/*  Return: TAL_OK / error cause                                         */
/*************************************************************************/
void cpu_CANGetSpeed (TAL_CAN_PORT ePort, uint32_t *pSpeed)
{
   if (pSpeed != NULL)
   {
      switch (ePort)
      {
         case TAL_CAN_PORT_1: *pSpeed = DCBArray[TAL_CAN_PORT_1]->Settings.dBitRate / 1000; break;
         case TAL_CAN_PORT_2: *pSpeed = DCBArray[TAL_CAN_PORT_2]->Settings.dBitRate / 1000; break;
         default:             *pSpeed = 0; break;
      }
   }

} /* cpu_CANIdentDeRegister */   

/*************************************************************************/
/*  CAN1_IRQHandler                                                      */
/*                                                                       */
/*  This is the Cortex CAN1 IRQ handler.                                 */
/*                                                                       */
/*  In    : none                                                         */
/*  Out   : none                                                         */
/*  Return: none                                                         */
/*************************************************************************/
void CAN1_IRQHandler (void)
{
   TAL_CPU_IRQ_ENTER();

   CAN_IRQHandler( DCBArray[TAL_CAN_PORT_1] );
   
   TAL_CPU_IRQ_EXIT();
} /* CAN1_IRQHandler */

/*************************************************************************/
/*  CAN2_IRQHandler                                                      */
/*                                                                       */
/*  This is the Cortex CAN2 IRQ handler.                                 */
/*                                                                       */
/*  In    : none                                                         */
/*  Out   : none                                                         */
/*  Return: none                                                         */
/*************************************************************************/
void CAN2_IRQHandler (void)
{
   TAL_CPU_IRQ_ENTER();

   CAN_IRQHandler( DCBArray[TAL_CAN_PORT_2] );
   
   TAL_CPU_IRQ_EXIT();
} /* CAN2_IRQHandler */

/*** EOF ***/
